/* Задание на урок:

1) Автоматизировать вопросы пользователю про фильмы при помощи цикла

2) Сделать так, чтобы пользователь не мог оставить ответ в виде пустой строки,
отменить ответ или ввести название фильма длинее, чем 50 символов. Если это происходит - 
возвращаем пользователя к вопросам опять

3) При помощи условий проверить  personalMovieDB.count, и если он меньше 10 - вывести сообщение
"Просмотрено довольно мало фильмов", если от 10 до 30 - "Вы классический зритель", а если больше - 
"Вы киноман". А если не подошло ни к одному варианту - "Произошла ошибка"

4) Потренироваться и переписать цикл еще двумя способами*/



'use strict';

const numberOfFilms = +prompt('Сколько фильмов вы уже посмотрели?', '');

const personaMovieDB = {
    count: numberOfFilms,
    movies: {},
    actors: {},
    genres: [],
    privat: false
};


if (personaMovieDB.count > 30) {
    alert('Вы киноман!');
} else if (personaMovieDB.count < 10) {
    alert('Просмотрено довольно мало фильмов');
} else if (personaMovieDB.count >= 10 && personaMovieDB.count <= 30) {
    alert('Вы классический зритель');
} else {
    alert('Произошла ошибка');
}


for (let i = 0; i < 3; i++) {
    const a = prompt('Назовите один из последних фильмов', ''),
          b = prompt('Поставьте ему оценку', '');
    if (a != null && b != null && a != '' && b != '' && a.length < 50) {
        personaMovieDB.movies[a] = b;
    }
    else {
        i--;
    }
}